Repository: daaihang/sprout
Catalog: mory/mory/Localizable.xcstrings
Source language: en
Languages: zh_hans

# settings.permission.location
source: Location
zh_hans: 定位

# settings.permission.location.explain
source: Adds place and weather context when you choose it.
zh_hans: 在你选择时加入地点和天气上下文。

# settings.permission.microphone
source: Microphone
zh_hans: 麦克风

# settings.permission.microphone.explain
source: Required only when recording voice memories.
zh_hans: 仅在录制语音记忆时需要。

# settings.permission.music.explain
source: Adds the currently playing track as an optional snapshot.
zh_hans: 可把当前播放歌曲作为可选快照加入。

# settings.permission.openSettings
source: Open Settings
zh_hans: 打开系统设置

# settings.permission.photos
source: Photos
zh_hans: 照片

# settings.permission.photos.explain
source: Lets you attach images and extract useful visual text.
zh_hans: 用于添加图片并提取有用的视觉文字。

# settings.permission.request
source: Request
zh_hans: 请求权限

# settings.permission.speech
source: Speech Recognition
zh_hans: 语音识别

# settings.permission.speech.explain
source: Turns recorded audio into editable text.
zh_hans: 把录音转换为可编辑文字。

# settings.permission.status.authorized
source: Allowed
zh_hans: 已允许

# settings.permission.status.denied
source: Denied
zh_hans: 已拒绝

# settings.permission.status.diagnosticRequired
source: Requires WeatherKit test
zh_hans: 需 WeatherKit 测试

# settings.permission.status.limited
source: Limited
zh_hans: 有限访问

# settings.permission.status.notDetermined
source: Not Asked
zh_hans: 未请求

# settings.permission.status.restricted
source: Restricted
zh_hans: 受限制

# settings.permission.status.unavailable
source: Unavailable
zh_hans: 不可用

# settings.permission.weather
source: Weather
zh_hans: 天气

# settings.permission.weather.explain
source: Uses location context to attach weather when available.
zh_hans: 在定位可用时附加天气上下文。

# settings.permissions.body
source: Phase A adds the product settings route. Detailed permission state and recovery actions are next.
zh_hans: Phase A 先接入产品设置入口；详细权限状态和恢复操作将在下一步接入。

# settings.permissions.footer
source: Text capture still works when optional context permissions are denied.
zh_hans: 即使可选上下文权限被拒绝，文字记录仍可使用。

# settings.permissions.subtitle
source: Location, photos, microphone, speech, music, and weather access.
zh_hans: 定位、照片、麦克风、语音、音乐和天气权限。

# settings.permissions.title
source: Permissions
zh_hans: 权限

# settings.preference.syncKey
source: Sync Key
zh_hans: 同步键

# settings.preference.updatedAt
source: Updated
zh_hans: 更新时间

# settings.privacy.ai.body
source: AI analysis may use the text and artifacts you save so it can create summaries, graph links, storylines, and reflections.
zh_hans: AI 分析可能使用你保存的文字和附件，用来生成摘要、关系图、故事线和感悟。

# settings.privacy.body
source: Mory keeps captured memories local-first. Future settings will explain what can be sent to the AI backend and how deletion works.
zh_hans: Mory 以本地优先方式保存记忆。后续设置会说明哪些内容可能发送到 AI 后端，以及删除如何生效。

# settings.privacy.context.body
source: Location, weather, and music are optional context candidates; denial does not block text capture.
zh_hans: 地点、天气和音乐是可选上下文；拒绝权限不会阻止文字记录。

# settings.privacy.debug.internal
source: This internal build exposes diagnostics for testing. Public builds hide debug-only tools.
zh_hans: 当前内部版本会显示测试诊断工具；公开版本会隐藏 Debug 工具。

# settings.privacy.debug.public
source: Public builds do not require Debug knowledge to use the app.
zh_hans: 公开版本不需要用户理解 Debug 工具也能使用。

# settings.privacy.debug.title
source: Diagnostics
zh_hans: 诊断

# settings.privacy.deletion.body
source: Deleting a memory removes derived local graph, storyline, and reflection data tied to that memory.
zh_hans: 删除记忆会同时移除与该记忆相关的本地关系图、故事线和感悟派生数据。

# settings.privacy.deletion.title
source: Deletion
zh_hans: 删除

# settings.privacy.localFirst.body
source: Mory saves captures locally first on this device.
zh_hans: Mory 会先把记录保存在这台设备本地。

# settings.privacy.localFirst.title
source: Local-first
zh_hans: 本地优先

# settings.privacy.subtitle
source: Local-first storage and AI request explanations.
zh_hans: 本地优先存储和 AI 请求说明。

# settings.privacy.title
source: Privacy
zh_hans: 隐私

# settings.runtime.environment
source: Environment
zh_hans: 环境

# settings.runtime.section
source: Runtime
zh_hans: 运行环境

# settings.runtime.version
source: Version
zh_hans: 版本

# signin.guest
source: Continue as Guest
zh_hans: 以访客身份继续

# signin.subtitle
source: Your personal memory companion
zh_hans: 你的私人记忆伙伴

source: Source labels
zh_hans: 来源标签

source: Sources
zh_hans: 来源

source: Split selected artifacts
zh_hans: 拆分选中内容

source: Start recording and attach voice to this memory.
zh_hans: 开始录音并附加到这条记忆。

source: State
zh_hans: 状态

source: Stop
zh_hans: 停止

source: Store
zh_hans: 存储

source: Stored
zh_hans: 已存储

source: Style
zh_hans: 样式

source: Suggestion cards
zh_hans: 建议卡片

source: Summary
zh_hans: 摘要

source: Symbol motion
zh_hans: 符号动效

# tab.arcs
source: Arcs
zh_hans: 故事线

# tab.debug
source: Debug
zh_hans: 调试

# tab.home
source: Home
zh_hans: 首页

# tab.insights
source: Insights
zh_hans: 洞察

# tab.memories
source: Memories
zh_hans: 记忆

# tab.people
source: People
zh_hans: 人物

# tab.reflections
source: Reflections
zh_hans: 感悟

# tab.search
source: Search
zh_hans: 搜索

# tab.timeline
source: Timeline
zh_hans: 时间线

# tab.today
source: Today
zh_hans: 今天

source: Task
zh_hans: 任务

source: Temperature %lld°C
zh_hans: 温度 %lld°C

source: These requests call the same cloud intelligence client used by capture, daily questions, chapter suggestions, photo semantics, and notification intent generation.
zh_hans: 这些请求会调用与记录、每日一问、章节建议、照片语义和通知意图生成相同的云端智能客户端。

source: This lab uses fixture-only data. It does not request permissions, save memories, or alter the production composer.
zh_hans: 此实验室只使用样例数据，不会请求权限、保存记忆或修改正式记录页。

source: This mutates local debug data. Existing captureOrigin values will not be overwritten.
zh_hans: 这会修改本地调试数据。已有 captureOrigin 值不会被覆盖。

source: This page calls the same repository and HomeBoardRuleEngine used by Today, then exposes the rule inputs, local preferences, and final visible cards.
zh_hans: 此页面调用与今天页相同的仓库和 HomeBoardRuleEngine，并展示规则输入、本地偏好和最终可见卡片。

source: This page exposes the home memory desktop rule inputs, visible cards, user-controlled cards, suggestions, and preference actions before the formal UI polish pass.
zh_hans: 此页面在正式 UI 打磨前展示首页记忆桌面的规则输入、可见卡片、用户控制卡片、建议和偏好操作。

source: This page uses the same repository job stores and IntelligenceJobWorker used during launch recovery and background intelligence preparation.
zh_hans: 此页面使用与启动恢复和后台智能准备相同的仓库任务存储和 IntelligenceJobWorker。

source: This place does not have enough linked location artifacts to split.
zh_hans: 此地点没有足够的关联位置内容可拆分。

source: This tool only updates artifacts that do not already have metadata.captureOrigin. Runtime readers do not infer fallback values.
zh_hans: 此工具只更新尚未包含 metadata.captureOrigin 的内容。运行时读取不会推断兜底值。

# timeline.empty.description
source: Capture memories to see them appear here organized by time.
zh_hans: 开始记录，记忆会按时间排列在这里。

# timeline.empty.title
source: No Memories Yet
zh_hans: 还没有记忆

# timeline.granularity
source: Granularity
zh_hans: 粒度

# timeline.memoryCount %lld
source: %lld memories
zh_hans: %lld 条记忆

# timeline.nav.title
source: Timeline
zh_hans: 时间线

source: Timezone
zh_hans: 时区

source: Title
zh_hans: 标题

source: Transcribing...
zh_hans: 正在转写...

source: Transcript
zh_hans: 转写

source: unapplied
zh_hans: 未应用

source: Unpin
zh_hans: 取消固定

source: Updated
zh_hans: 已更新

source: Use APNs environment/topic, sent/failed/retried/permanent counters, and last_error to verify real-device push delivery.
zh_hans: 使用 APNs 环境/topic、已发送/失败/重试/永久失败计数和 last_error 来验证真机推送投递。

source: Use Manual for user-added legacy artifacts, Context for auto-collected legacy context artifacts, Imported for imports, or Inferred for pipeline-generated content.
zh_hans: 用户添加的旧内容使用 Manual，自动采集的旧上下文使用 Context，导入内容使用 Imported，流水线生成内容使用 Inferred。

source: Use this to confirm whether sign-in is blocked by Keychain persistence, server auth, or session state.
zh_hans: 用于确认登录是否卡在 Keychain 持久化、服务端认证或会话状态。

source: User board cards
zh_hans: 用户看板卡片

source: UserDefaults scopes
zh_hans: UserDefaults 作用域

source: UV %@
zh_hans: 紫外线 %@

source: Visible cards
zh_hans: 可见卡片

source: Voice
zh_hans: 语音

source: Weather cards keep kind=weather. Origin remains debug data; production cards hide source labels.
zh_hans: 天气卡片保持 kind=weather。Origin 仍作为调试数据保留；生产卡片隐藏来源标签。

source: Weather Lab
zh_hans: 天气实验室
